app/controllers/scoretables_controller.rb

  def index
    puts "Here is index."
    @scoretables = Scoretable.order(:score).first(5)
---
SELECT "scoretables".* FROM "scoretables"

  def show
    @scoretables = Scoretable.order(:score).first(5)
---
SELECT "scoretables".* FROM "scoretables" ORDER BY "scoretables".score ASC LIMIT 5

  def create
    puts "START"
    req_body = request.body.read()
    puts req_body
    puts "END"

    div_part = req_body.partition("|")

    @scoretable = Scoretable.new(:name=>div_part[0], :score=>div_part[2])
=begin
    if @scoretable.save
      respond_with(Scoretable.order(:score).first(5))
---
INSERT INTO "scoretables" ("created_at", "name", "score", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 30 Jun 2014 11:44:17 UTC +00:00], ["name", "Anonymous"], ["score", 6], ["updated_at", Mon, 30 Jun 2014 11:44:17 UTC +00:00]]
SELECT "scoretables".* FROM "scoretables" ORDER BY "scoretables".score ASC LIMIT 5

    def set_scoretable
      @scoretable = Scoretable.find(params[:id])
---
SELECT "scoretables".* FROM "scoretables" WHERE "scoretables"."id" = ? LIMIT 1  [["id", "index"]]